admbase/src/Documents/ПриказОбУстанволенииСтоимостиПроживания/ПриказОбУстанволенииСтоимостиПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбУстанволенииСтоимостиПроживания</name>
  <registerRecords>InformationRegister.СтоимостьПроживанияВОбщежитии</registerRecords>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>АдресРегистрации</name>
      <type>
        <types>CatalogRef.АдресаРегистрации</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/СтоимостьПроживанияВОбщежитии/СтоимостьПроживанияВОбщежитии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьПроживанияВОбщежитии</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Documents/ПриказОбУстанволенииСтоимостиПроживания/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	Детали.АдресРегистрации,
	|	Детали.Стоимость,
	|	Шапка.ДатаИзменения КАК Период,
	|	Детали.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ПриказОбУстанволенииСтоимостиПроживания.ДетальныеЗаписи КАК Детали
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриказОбУстанволенииСтоимостиПроживания КАК Шапка
	|		ПО Детали.Ссылка = Шапка.Ссылка
	|ГДЕ
	|	Детали.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Детали.НомерСтроки";
#КонецОбласти
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.СтоимостьПроживанияВОбщежитии.Добавить(), Выборка);
	КонецЦикла;
	
	Движения.СтоимостьПроживанияВОбщежитии.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#КонецЕсли
